mysql.org
#+TITLE: MySql
#+OPTIONS: num:nil
#+SETUPFILE: /home/silin/.emacs.d/org-html-themes/org/theme-bigblow.setup
#+STARTUP: content
* 配置
** 安装
#+begin_src 
sudo apt install mysql-server
sudo mysql_secure_installation
#+end_src

此时是给电脑的root用户，创建了一个mysql里root用户的数据库
*** 电脑的root用户
sudo apt install mysql-server
sudo mysql_secure_installation
上面默认设置的是电脑root用户的密码，也就是说只能 sudo 登陆 : sudo mysql -u root -p

*** 电脑的普通用户进入配置


|------+--------------------------+---------------------------------------------------+------------------------------------------------------------|
| step | env                      | command                                           | explain                                                    |
|   01 | terminal                 | sudo mysql -u root -p                             | 电脑root进入mysql的root                                    |
|   02 | mysql                    | select User, Host, plugin from user;              | 获取                                                       |
|   03 | mysql                    | update user set plugin='mysql_ native_ password'; |                                                            |
|   04 | mysql                    | select User, Host, plugin from user;              | 获取                                                       |
|   05 | mysql                    | flush privileges;                                 | 权限更新 in mysqld:skip-grant-tables                       |
|   06 | mysql [fn:nopasswordset] | C-d C-d                                           | 退出                                                       |
|   07 | terminal                 | mysql -u root    BUT NOT (mysql -u root -p)       | 不能 -p, 密码为空，直接Enter进入                           |
|   08 | mysql                    | set password for root@localhost = '123'           | 老版本  = password('123');                                 |
|   09 | error                    | 123 is too simple, just not satisfy the           | requirement to password so check the password requirement. |
|   10 | mysql                    | show variables like 'validate_ password%';        | 显示密码设置要求                                           |
|   11 | mysql                    | set global validate_ password_ length=3;          | 设置密码长度要求 为 3                                      |
|   12 | mysql                    | set global validate_ password_ policy=0;          | 设置密码要求概要  为 0                                     |
|   13 | mysql                    | set password for root@localhost = '123'           | 老版本  = password('123');                                 |
|   14 | mysql                    | flush privileges;                                 | 权限更新 in mysqld:skip-grant-tables                       |
|   15 | terminal                 | mysql -u root -p                                  | 密码 123 , 登陆时不需要 sudo 开头                          |
|------+--------------------------+---------------------------------------------------+------------------------------------------------------------|

** 给数据库添加用户
在进入数据库的root后，mysql 添加普通用户 [[https://www.jianshu.com/p/d7b9c468f20d][简书连接]] .

create USER 'sx'@'localhost' IDENTIFIED BY 'scofild';
创建sx用户，只能本地连接，秘密scofild

GRANT ALL ON testforjava.course TO 'sx'@'localhost';
开放testforjava数据集中的course数据表的所有全线给sx 用户

退出后登陆 sx 用户
mysql -u sx -p 
scofild

便只能看到有权限的数据集

** 查看数据库及添加数据库

show databases;

create databese kurs;

drop databases kurs;

** 中文设置 

| show variables like 'character%'; |
|                                   |


听说mysql的utf8不是真的utf8，需要使用utf8mb4.
在用户登陆后用set charactater server database = utf8 或者utf8mb4， 只要重开接入，设置就复原。
只有在/etc/mysql/中的mysql.cnf中的clint/mysqld/mysql字段加入以上设定，重启生效

| 在[client]下追加 | default-character-set=utf8 |
| 在[mysqld]下追加 | character-set-server=utf8  |
| 在[mysql]下追加  | default-character-set=utf8 |

** 特殊字符
 - 用`ry-vue` 
 create database `ry-vue`;

** 执行sql文件
   mysql -u root  -p xxxx
   use database;
   source .../file.sql 

* 进入数据库并操作
** 进入数据库
create databese testforjava;
use testforjava;
** 插入表格
create table course(id int primary key atuo_increment,  kurs_name varchar(50), kurs_length
varchar(50),teacher varchar(50), categeory varchar(50));
for later version, only works for auto_increment, not for identity(m,n)
** 插入值
insert into kurs values(1, 'C++', 23, 'su', 'basic');
insert into kurs values (2, 'Python', 50, 'morvan', 'hard');
insert into kurs values(3, 'CLI', 22, 'su', 'basic');


或者 不完整信息

insert into kurs(id, kurs_name, categeory) values(4, 'java', 'basic'); 
(指定属性给值)
** 查看表格 

show tables;

describe course;
** 编辑表格

alter table course rename kurs;  (重命名)

alter table kurs add link varchar(50); (添加属性，列)

alter table kurs drop column link;   (将该列删除)

alter table kurs modify teacher varchar(100); (修改该列的属性，增加容量)

alter table kurs change column teacher lecture varchar(100); (修改该列的名称，和属性，)

** 读取内容

select * from kurs;

select kurs_name, lecture from kurs;

读取内容时，不重复显示

select distinct lecture from kurs;

** 高级条件查询

select * from course where course_name = 'gnome';

select * from course where course_length > 10;

select * from course where lecture='su' and categeory='adv';
(满足这两个要求的)
select * from course order by  course_length desc;
(由课程长度有小到大排序) 后面加desc 则反序排序
* 管理
