mysql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-23 Mo 19:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySql</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="silin" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MySql</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaed0307">配置</a>
<ul>
<li><a href="#org864d7a1">安装</a>
<ul>
<li><a href="#org814b1b0">电脑的root用户</a></li>
<li><a href="#org48f4fba">电脑的普通用户进入配置</a></li>
</ul>
</li>
<li><a href="#orgb02f8ee">给数据库添加用户</a></li>
<li><a href="#org2ed178f">查看数据库及添加数据库</a></li>
<li><a href="#org983621f">中文</a></li>
<li><a href="#org0a97c0d">特殊字符</a></li>
<li><a href="#org924004e">执行sql文件</a></li>
</ul>
</li>
<li><a href="#orgfcce1b9">进入数据库并操作</a>
<ul>
<li><a href="#org33e1cc4">进入数据库</a></li>
<li><a href="#orgae906e5">插入表格</a></li>
<li><a href="#org606b04c">插入值</a></li>
<li><a href="#org35b207e">查看表格</a></li>
<li><a href="#orge0965d4">编辑表格</a></li>
<li><a href="#org9b622f0">读取内容</a></li>
<li><a href="#org0a6baef">高级条件查询</a></li>
</ul>
</li>
<li><a href="#org6f01b75">管理</a>
<ul>
<li><a href="#orgbdebbb9">用户管理</a></li>
<li><a href="#org0dfb4da">权限</a>
<ul>
<li><a href="#orgd554a89">查询</a></li>
<li><a href="#org5678f96">授予</a></li>
<li><a href="#orgfd954ac">撤销</a></li>
</ul>
</li>
<li><a href="#orga084fdc">时区</a></li>
<li><a href="#orgef61b47">删除</a></li>
<li><a href="#org754d310">更新</a></li>
</ul>
</li>
<li><a href="#orga7a4eca">备份和还原</a>
<ul>
<li><a href="#org5a65357">check the database</a></li>
<li><a href="#org862b67d">dump database</a></li>
<li><a href="#org3ecb4f0">delete database</a></li>
<li><a href="#org27488d5">recover testforjava</a></li>
</ul>
</li>
<li><a href="#orgce55be1">权限</a></li>
<li><a href="#org856a2bd">数据的备份</a></li>
<li><a href="#org1327a1e">python connect with mysql Beispile</a></li>
<li><a href="#orgc5ceb31">java connect with mysql</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaed0307" class="outline-2">
<h2 id="orgaed0307">配置</h2>
<div class="outline-text-2" id="text-orgaed0307">
</div>
<div id="outline-container-org864d7a1" class="outline-3">
<h3 id="org864d7a1">安装</h3>
<div class="outline-text-3" id="text-org864d7a1">
<pre class="example">
sudo apt install mysql-server
sudo mysql_secure_installation
</pre>

<p>
此时是给电脑的root用户，创建了一个mysql里root用户的数据库
</p>
</div>
<div id="outline-container-org814b1b0" class="outline-4">
<h4 id="org814b1b0">电脑的root用户</h4>
<div class="outline-text-4" id="text-org814b1b0">
<p>
上面默认设置的是电脑root用户的密码，也就是说只能 sudo 登陆 : sudo mysql -u root -p
</p>
</div>
</div>

<div id="outline-container-org48f4fba" class="outline-4">
<h4 id="org48f4fba">电脑的普通用户进入配置</h4>
<div class="outline-text-4" id="text-org48f4fba">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">step</td>
<td class="org-left">env</td>
<td class="org-left">command</td>
<td class="org-left">explain</td>
</tr>

<tr>
<td class="org-right">01</td>
<td class="org-left">terminal</td>
<td class="org-left">sudo mysql -u root -p</td>
<td class="org-left">电脑root进入mysql的root</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">mysql</td>
<td class="org-left">select User, Host, plugin from user;</td>
<td class="org-left">获取</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">mysql</td>
<td class="org-left">update user set plugin='mysql_ native_ password';</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">mysql</td>
<td class="org-left">select User, Host, plugin from user;</td>
<td class="org-left">获取</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">mysql</td>
<td class="org-left">flush privileges;</td>
<td class="org-left">权限更新 in mysqld:skip-grant-tables</td>
</tr>

<tr>
<td class="org-right">06</td>
<td class="org-left">mysql <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
<td class="org-left">C-d C-d</td>
<td class="org-left">退出</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">terminal</td>
<td class="org-left">mysql -u root    BUT NOT (mysql -u root -p)</td>
<td class="org-left">不能 -p, 密码为空，直接Enter进入</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">mysql</td>
<td class="org-left">set password for root@localhost = '123'</td>
<td class="org-left">老版本  = password('123');</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">error</td>
<td class="org-left">123 is too simple, just not satisfy the</td>
<td class="org-left">requirement to password so check the password requirement.</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">mysql</td>
<td class="org-left">show variables like 'validate_ password%';</td>
<td class="org-left">显示密码设置要求</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">mysql</td>
<td class="org-left">set global validate_ password_ length=3;</td>
<td class="org-left">设置密码长度要求 为 3</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">mysql</td>
<td class="org-left">set global validate_ password_ policy=0;</td>
<td class="org-left">设置密码要求概要  为 0</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">mysql</td>
<td class="org-left">set password for root@localhost = '123'</td>
<td class="org-left">老版本  = password('123');</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">terminal</td>
<td class="org-left">mysql -u root -p</td>
<td class="org-left">密码 123 , 登陆时不需要 sudo 开头</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgb02f8ee" class="outline-3">
<h3 id="orgb02f8ee">给数据库添加用户</h3>
<div class="outline-text-3" id="text-orgb02f8ee">
<p>
在进入数据库的root后，mysql 添加普通用户 <a href="https://www.jianshu.com/p/d7b9c468f20d">简书连接</a> .
</p>

<p>
create USER 'sx'@'localhost' IDENTIFIED BY 'scofild';
创建sx用户，只能本地连接，秘密scofild
</p>

<p>
GRANT ALL ON testforjava.course TO 'sx'@'localhost';
开放testforjava数据集中的course数据表的所有全线给sx 用户
</p>

<p>
退出后登陆 sx 用户
mysql -u sx -p 
scofild
</p>

<p>
便只能看到有权限的数据集
</p>
</div>
</div>

<div id="outline-container-org2ed178f" class="outline-3">
<h3 id="org2ed178f">查看数据库及添加数据库</h3>
<div class="outline-text-3" id="text-org2ed178f">
<p>
show databases;
</p>

<p>
create databese kurs;
</p>

<p>
drop databases kurs;
</p>
</div>
</div>

<div id="outline-container-org983621f" class="outline-3">
<h3 id="org983621f">中文</h3>
<div class="outline-text-3" id="text-org983621f">
<p>
听说mysql的utf8不是真的utf8，需要使用utf8mb4.
在用户登陆后用set charactater server database = utf8 或者utf8mb4， 只要重开接入，设置就复原。
只有在/etc/mysql/中的mysql.cnf中的clint/mysqld/mysql字段加入以上设定，重启生效
</p>
</div>
</div>

<div id="outline-container-org0a97c0d" class="outline-3">
<h3 id="org0a97c0d">特殊字符</h3>
<div class="outline-text-3" id="text-org0a97c0d">
<ul class="org-ul">
<li>用`ry-vue`</li>
</ul>
<p>
create database `ry-vue`;
</p>
</div>
</div>

<div id="outline-container-org924004e" class="outline-3">
<h3 id="org924004e">执行sql文件</h3>
<div class="outline-text-3" id="text-org924004e">
<p>
mysql -u root  -p xxxx
use database;
source &#x2026;/file.sql 
</p>
</div>
</div>
</div>

<div id="outline-container-orgfcce1b9" class="outline-2">
<h2 id="orgfcce1b9">进入数据库并操作</h2>
<div class="outline-text-2" id="text-orgfcce1b9">
</div>
<div id="outline-container-org33e1cc4" class="outline-3">
<h3 id="org33e1cc4">进入数据库</h3>
<div class="outline-text-3" id="text-org33e1cc4">
<p>
create databese testforjava;
use testforjava;
</p>
</div>
</div>
<div id="outline-container-orgae906e5" class="outline-3">
<h3 id="orgae906e5">插入表格</h3>
<div class="outline-text-3" id="text-orgae906e5">
<p>
create table course(id int primary key atuo<sub>increment</sub>,  kurs<sub>name</sub> varchar(50), kurs<sub>length</sub>
varchar(50),teacher varchar(50), categeory varchar(50));
for later version, only works for auto<sub>increment</sub>, not for identity(m,n)
</p>
</div>
</div>
<div id="outline-container-org606b04c" class="outline-3">
<h3 id="org606b04c">插入值</h3>
<div class="outline-text-3" id="text-org606b04c">
<p>
insert into kurs values(1, 'C++', 23, 'su', 'basic');
insert into kurs values (2, 'Python', 50, 'morvan', 'hard');
insert into kurs values(3, 'CLI', 22, 'su', 'basic');
</p>


<p>
或者 不完整信息
</p>

<p>
insert into kurs(id, kurs<sub>name</sub>, categeory) values(4, 'java', 'basic'); 
(指定属性给值)
</p>
</div>
</div>
<div id="outline-container-org35b207e" class="outline-3">
<h3 id="org35b207e">查看表格</h3>
<div class="outline-text-3" id="text-org35b207e">
<p>
show tables;
</p>

<p>
describe course;
</p>
</div>
</div>
<div id="outline-container-orge0965d4" class="outline-3">
<h3 id="orge0965d4">编辑表格</h3>
<div class="outline-text-3" id="text-orge0965d4">
<p>
alter table course rename kurs;  (重命名)
</p>

<p>
alter table kurs add link varchar(50); (添加属性，列)
</p>

<p>
alter table kurs drop column link;   (将该列删除)
</p>

<p>
alter table kurs modify teacher varchar(100); (修改该列的属性，增加容量)
</p>

<p>
alter table kurs change column teacher lecture varchar(100); (修改该列的名称，和属性，)
</p>
</div>
</div>

<div id="outline-container-org9b622f0" class="outline-3">
<h3 id="org9b622f0">读取内容</h3>
<div class="outline-text-3" id="text-org9b622f0">
<p>
select * from kurs;
</p>

<p>
select kurs<sub>name</sub>, lecture from kurs;
</p>

<p>
读取内容时，不重复显示
</p>

<p>
select distinct lecture from kurs;
</p>
</div>
</div>

<div id="outline-container-org0a6baef" class="outline-3">
<h3 id="org0a6baef">高级条件查询</h3>
<div class="outline-text-3" id="text-org0a6baef">
<p>
select * from course where course<sub>name</sub> = 'gnome';
</p>

<p>
select * from course where course<sub>length</sub> &gt; 10;
</p>

<p>
select * from course where lecture='su' and categeory='adv';
(满足这两个要求的)
select * from course order by  course<sub>length</sub> desc;
(由课程长度有小到大排序) 后面加desc 则反序排序
</p>
</div>
</div>
</div>
