mysql.org
** 用户管理

show databases;
use mysql;
show tables;

mysqld --skip-grant-tables (开启mysql的无验证登陆，对于遗失密码后）
select host,user from user; (查看所有用户)

create user si identified by 'lin'; (添加si用户，密码为lin)

drop user si; (删除si用户)

rename user si to shi; (将si重命名为shi)

set password = password('new');  (将当前用户密码改为new)

set password for si = password(link); (将si用户密码重置为link)
** 权限
*** 查询
 show grants for 'newuser'@'localhost'
*** 授予
grants 权限列表 on 数据库名.表明 to '用户'@'主机名'
grants all on *.* 'newuser'@'localhost'
*** 撤销
revoke delete on *.* from 'newuser'@'localhost'
** 时区
set global time_zone = '+8:00';  ##修改mysql全局时区为北京时间，即我们所在的东8区
set time_zone = '+8:00';  ##修改当前会话时区
flush privileges;  #立即生效
** 删除

delect * from course where id =2;

delect * from course 删除整个表的信息
** 更新
update course set lecture = 'Lee'  where id =3;

* 备份和还原 
** check the database 
#+name: my-query
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser root
#+header: :dbpassword "123456"
#+header: :database testforjava
#+begin_src sql
show tables;
#+end_src

#+RESULTS: my-query
| Database           |
|--------------------|
| information_schema |
| 0812erp            |
| mysql              |
| performance_schema |
| sys                |
| testforjava        |

** dump database

#+begin_src sh
  mysqldump -uroot -p123456 testforjava > ~/Desktop/mysql.sql
#+end_src

#+RESULTS:

** delete database
#+name: my-query1
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser root
#+header: :dbpassword "123456"
#+begin_src sql
drop database testforjava;
show databases;
#+end_src

#+RESULTS: my-query1
| Database           |
|--------------------|
| information_schema |
| 0812erp            |
| mysql              |
| performance_schema |
| sys                |

** recover testforjava
#+name: my-query2
#+header: :engine mysql
#+header: :dbhost localhost
#+header: :dbuser root
#+header: :dbpassword "123456"
#+begin_src sql
create database testforjava;
use testforjava;
source ~/Desktop/mysql.sql
show databases;
#+end_src

#+RESULTS: my-query2
| Database           |
|--------------------|
| information_schema |
| 0812erp            |
| mysql              |
| performance_schema |
| sys                |
| testforjava        |

* 权限

grant all privileges on *.* to 'shi'@'%' identified by 'lining';

grant all privileges on *.* to 'root'@'%' identified by 'lining';

* 数据的备份

mysqldump -u root -p kurs > firstForFun.sql;
(在root下将kurs数据库备份为FirstForFun.sql)

mysql -u root -p kurs < Firstforfun.sql
(将备份文件FirstForFun.sql恢复为kurs数据库)

(此两个语句是在退出sql后的terminal执行的)
* python connect with mysql Beispile

#+begin_src python :results output

  import pymysql
  db = pymysql.connect("localhost", "root", "123456", "testforjava")
  cursor = db.cursor()
  sql = """create table  IF NOT EXISTS course(id int,  kurs_name varchar(50), kurs_length varchar(50),teacher varchar(50), categeory varchar(50))"""
  cursor.execute(sql)
  sql = """insert into course values(7, 'CLI', 22, 'su', 'basic')"""
  cursor.execute(sql)
  sql = """insert into course values(8, 'CLI', 22, 'su', 'basic')"""
  cursor.execute(sql)
  db.commit()

  sql1 = """select * from course"""
  cursor.execute(sql1)
  results = cursor.fetchall()
  print('\n')
  for row in results:
      num = row[0]
      name = row[1]
      age = row[2]
      right = row[3]
      dis = row[4]
      print("num is %7s, name is %7s, age is %7s, right is %7s, dis is %7s" %
            (num, name, age, right, dis))

  # if __name__ == "__main__":
  cursor.close()

#+end_src

#+RESULTS:
#+begin_example


num is       1, name is     C++, age is      23, right is      su, dis is   basic
num is       2, name is  Python, age is      50, right is  morvan, dis is    hard
num is       3, name is     CLI, age is      22, right is      su, dis is   basic
num is       4, name is     CLI, age is      25, right is      su, dis is   basic
num is       4, name is     CLI, age is      25, right is      su, dis is   basic
num is       7, name is     CLI, age is      22, right is      su, dis is   basic
num is       8, name is     CLI, age is      22, right is      su, dis is   basic
num is       7, name is     CLI, age is      22, right is      su, dis is   basic
num is       8, name is     CLI, age is      22, right is      su, dis is   basic
num is       7, name is     CLI, age is      22, right is      su, dis is   basic
num is       8, name is     CLI, age is      22, right is      su, dis is   basic
#+end_example






