mysql.html
<div id="outline-container-org6f01b75" class="outline-2">
<h2 id="org6f01b75">管理</h2>
<div class="outline-text-2" id="text-org6f01b75">
</div>
<div id="outline-container-orgbdebbb9" class="outline-3">
<h3 id="orgbdebbb9">用户管理</h3>
<div class="outline-text-3" id="text-orgbdebbb9">
<p>
show databases;
use mysql;
show tables;
</p>

<p>
mysqld &#x2013;skip-grant-tables (开启mysql的无验证登陆，对于遗失密码后）
select host,user from user; (查看所有用户)
</p>

<p>
create user si identified by 'lin'; (添加si用户，密码为lin)
</p>

<p>
drop user si; (删除si用户)
</p>

<p>
rename user si to shi; (将si重命名为shi)
</p>

<p>
set password = password('new');  (将当前用户密码改为new)
</p>

<p>
set password for si = password(link); (将si用户密码重置为link)
</p>
</div>
</div>
<div id="outline-container-org0dfb4da" class="outline-3">
<h3 id="org0dfb4da">权限</h3>
<div class="outline-text-3" id="text-org0dfb4da">
</div>
<div id="outline-container-orgd554a89" class="outline-4">
<h4 id="orgd554a89">查询</h4>
<div class="outline-text-4" id="text-orgd554a89">
<p>
show grants for 'newuser'@'localhost'
</p>
</div>
</div>
<div id="outline-container-org5678f96" class="outline-4">
<h4 id="org5678f96">授予</h4>
<div class="outline-text-4" id="text-org5678f96">
<p>
grants 权限列表 on 数据库名.表明 to '用户'@'主机名'
grants all on <b>.</b> 'newuser'@'localhost'
</p>
</div>
</div>
<div id="outline-container-orgfd954ac" class="outline-4">
<h4 id="orgfd954ac">撤销</h4>
<div class="outline-text-4" id="text-orgfd954ac">
<p>
revoke delete on <b>.</b> from 'newuser'@'localhost'
</p>
</div>
</div>
</div>
<div id="outline-container-orga084fdc" class="outline-3">
<h3 id="orga084fdc">时区</h3>
<div class="outline-text-3" id="text-orga084fdc">
<p>
set global time<sub>zone</sub> = '+8:00';  ##修改mysql全局时区为北京时间，即我们所在的东8区
set time<sub>zone</sub> = '+8:00';  ##修改当前会话时区
flush privileges;  #立即生效
</p>
</div>
</div>
<div id="outline-container-orgef61b47" class="outline-3">
<h3 id="orgef61b47">删除</h3>
<div class="outline-text-3" id="text-orgef61b47">
<p>
delect * from course where id =2;
</p>

<p>
delect * from course 删除整个表的信息
</p>
</div>
</div>
<div id="outline-container-org754d310" class="outline-3">
<h3 id="org754d310">更新</h3>
<div class="outline-text-3" id="text-org754d310">
<p>
update course set lecture = 'Lee'  where id =3;
</p>
</div>
</div>
</div>

<div id="outline-container-orga7a4eca" class="outline-2">
<h2 id="orga7a4eca">备份和还原</h2>
<div class="outline-text-2" id="text-orga7a4eca">
</div>
<div id="outline-container-org5a65357" class="outline-3">
<h3 id="org5a65357">check the database</h3>
<div class="outline-text-3" id="text-org5a65357">
<div class="org-src-container">
<pre class="src src-sql" id="org7a362de">show tables;
</pre>
</div>
</div>
</div>

<div id="outline-container-org862b67d" class="outline-3">
<h3 id="org862b67d">dump database</h3>
<div class="outline-text-3" id="text-org862b67d">
<div class="org-src-container">
<pre class="src src-sh">mysqldump -uroot -p123456 testforjava &gt; ~/Desktop/mysql.sql
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ecb4f0" class="outline-3">
<h3 id="org3ecb4f0">delete database</h3>
<div class="outline-text-3" id="text-org3ecb4f0">
<div class="org-src-container">
<pre class="src src-sql" id="orge2fce09"><span style="color: #4f97d7; font-weight: bold;">drop</span> database testforjava;
show databases;
</pre>
</div>
</div>
</div>

<div id="outline-container-org27488d5" class="outline-3">
<h3 id="org27488d5">recover testforjava</h3>
<div class="outline-text-3" id="text-org27488d5">
<div class="org-src-container">
<pre class="src src-sql" id="orgea3ef5a"><span style="color: #4f97d7; font-weight: bold;">create</span> database testforjava;
use testforjava;
<span style="color: #4f97d7; font-weight: bold;">source</span> ~/Desktop/mysql.<span style="color: #4f97d7; font-weight: bold;">sql</span>
show databases;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgce55be1" class="outline-2">
<h2 id="orgce55be1">权限</h2>
<div class="outline-text-2" id="text-orgce55be1">
<p>
grant all privileges on <b>.</b> to 'shi'@'%' identified by 'lining';
</p>

<p>
grant all privileges on <b>.</b> to 'root'@'%' identified by 'lining';
</p>
</div>
</div>

<div id="outline-container-org856a2bd" class="outline-2">
<h2 id="org856a2bd">数据的备份</h2>
<div class="outline-text-2" id="text-org856a2bd">
<p>
mysqldump -u root -p kurs &gt; firstForFun.sql;
(在root下将kurs数据库备份为FirstForFun.sql)
</p>

<p>
mysql -u root -p kurs &lt; Firstforfun.sql
(将备份文件FirstForFun.sql恢复为kurs数据库)
</p>

<p>
(此两个语句是在退出sql后的terminal执行的)
</p>
</div>
</div>
<div id="outline-container-org1327a1e" class="outline-2">
<h2 id="org1327a1e">python connect with mysql Beispile</h2>
<div class="outline-text-2" id="text-org1327a1e">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">import</span> pymysql
<span style="color: #7590db;">db</span> = pymysql.connect(<span style="color: #2d9574;">"localhost"</span>, <span style="color: #2d9574;">"root"</span>, <span style="color: #2d9574;">"123456"</span>, <span style="color: #2d9574;">"testforjava"</span>)
<span style="color: #7590db;">cursor</span> = db.cursor()
<span style="color: #7590db;">sql</span> = <span style="color: #2d9574;">"""create table  IF NOT EXISTS course(id int,  kurs_name varchar(50), kurs_length varchar(50),teacher varchar(50), categeory varchar(50))"""</span>
cursor.execute(sql)
<span style="color: #7590db;">sql</span> = <span style="color: #2d9574;">"""insert into course values(7, 'CLI', 22, 'su', 'basic')"""</span>
cursor.execute(sql)
<span style="color: #7590db;">sql</span> = <span style="color: #2d9574;">"""insert into course values(8, 'CLI', 22, 'su', 'basic')"""</span>
cursor.execute(sql)
db.commit()

<span style="color: #7590db;">sql1</span> = <span style="color: #2d9574;">"""select * from course"""</span>
cursor.execute(sql1)
<span style="color: #7590db;">results</span> = cursor.fetchall()
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">'\n'</span>)
<span style="color: #4f97d7; font-weight: bold;">for</span> row <span style="color: #4f97d7; font-weight: bold;">in</span> results:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">num</span> = row[0]
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">name</span> = row[1]
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">age</span> = row[2]
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">right</span> = row[3]
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">dis</span> = row[4]
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"num is %7s, name is %7s, age is %7s, right is %7s, dis is %7s"</span> %
          (num, name, age, right, dis))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if __name__ == "__main__":</span>
cursor.close()

</pre>
</div>
</div>
</div>
