mysql.html






<div id="outline-container-orgc5ceb31" class="outline-2">
<h2 id="orgc5ceb31">java connect with mysql</h2>
<div class="outline-text-2" id="text-orgc5ceb31">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">sql</span>.*;
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">JavaConnSQL</span>
{
    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">JDBC_DRIVER</span> = <span style="color: #2d9574;">"com.mysql.cj.jdbc.Driver"</span>;  
    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">DB_URL</span> = <span style="color: #2d9574;">"jdbc:mysql://localhost:3306/testforjava?useSSL=false&amp;serverTimezone=UTC"</span>;
    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">USER</span> = <span style="color: #2d9574;">"root"</span>;
    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">PASS</span> = <span style="color: #2d9574;">"123456"</span>;
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>( <span style="color: #ce537a; font-weight: bold;">String</span>[] <span style="color: #7590db;">args</span> )
    {
        System.out.println( <span style="color: #2d9574;">"Hello World!"</span> );
        System.out.println(<span style="color: #2d9574;">"&#22312;dir&#20013;&#29983;&#25104;&#30340;&#20195;&#30721;&#65292; &#22914;&#26524;dir&#20013;&#26377;&#39537;&#21160;&#65292;&#21017;&#21487;&#20197;&#25191;&#34892;mysql&#30340;&#36830;&#25509;"</span>);
        System.out.println(<span style="color: #2d9574;">"&#25552;&#21069;&#25191;&#34892;"</span>);
        System.out.println(<span style="color: #2d9574;">"export CLASSPATH=mysql-connector-java-8.0.20.jar:. "</span>);
        <span style="color: #ce537a; font-weight: bold;">Connection</span> <span style="color: #7590db;">conn</span> = <span style="color: #a45bad;">null</span>;
        <span style="color: #ce537a; font-weight: bold;">Statement</span> <span style="color: #7590db;">stmt</span> = <span style="color: #a45bad;">null</span>;
        <span style="color: #4f97d7; font-weight: bold;">try</span>{
            Class.forName(JDBC_DRIVER);
            System.out.println(<span style="color: #2d9574;">"&#36830;&#25509;&#25968;&#25454;&#24211;..."</span>);
            conn = DriverManager.getConnection(DB_URL,USER,PASS);

            System.out.println(<span style="color: #2d9574;">" &#23454;&#20363;&#21270;Statement&#23545;&#35937;..."</span>);
            stmt = conn.createStatement();
            <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">sql</span>;
            sql = <span style="color: #2d9574;">"SELECT id, kurs_name FROM course"</span>;
            <span style="color: #ce537a; font-weight: bold;">ResultSet</span> <span style="color: #7590db;">rs</span> = stmt.executeQuery(sql);

            <span style="color: #4f97d7; font-weight: bold;">while</span>(rs.next()){
                <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">id</span>  = rs.getInt(<span style="color: #2d9574;">"id"</span>);
                <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">name</span> = rs.getString(<span style="color: #2d9574;">"kurs_name"</span>);
                <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#36755;&#20986;&#25968;&#25454;</span>
                System.out.print(<span style="color: #2d9574;">"ID: "</span> + id);
                System.out.print(<span style="color: #2d9574;">", kurs name &#31449;&#28857;&#21517;&#31216;: "</span> + name);
                System.out.print(<span style="color: #2d9574;">"\n"</span>);
            }
            rs.close();
            stmt.close();
            conn.close();
        }<span style="color: #4f97d7; font-weight: bold;">catch</span>(<span style="color: #ce537a; font-weight: bold;">SQLException</span> <span style="color: #7590db;">se</span>){
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22788;&#29702; JDBC &#38169;&#35823;</span>
            se.printStackTrace();
        }<span style="color: #4f97d7; font-weight: bold;">catch</span>(<span style="color: #ce537a; font-weight: bold;">Exception</span> <span style="color: #7590db;">e</span>){
            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22788;&#29702; Class.forName &#38169;&#35823;</span>
            e.printStackTrace();
        }
    }
}

</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
此后，电脑的root用户将不能登陆，而此时电脑的普通,  用户可以登陆，但是没有设置密码，不能用 -p 登陆
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: silin</p>
<p class="date">Created: 2020-11-23 Mo 19:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
